FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0715_DashBoard_096_ESP32/0715_DashBoard_096_ESP32.ino
  if (irqA) {
    queueButtonA(now);
    g_btnALastRawPressed = rawA;
    g_btnALastChangeMs = now;
  }
  if (irqB) {
    queueButtonB(now);
    g_btnBLastRawPressed = rawB;
    g_btnBLastChangeMs = now;
  }

  if (rawA != g_btnALastRawPressed) {
    g_btnALastRawPressed = rawA;
    g_btnALastChangeMs = now;
  }
  if (rawB != g_btnBLastRawPressed) {
    g_btnBLastRawPressed = rawB;
    g_btnBLastChangeMs = now;
  }

  if ((now - g_btnALastChangeMs) >= BTN_DEBOUNCE_MS && rawA != g_btnA) {
    bool old = g_btnA;
    g_btnA = rawA;
    if (g_btnA && !old) queueButtonA(now);
  }
  if ((now - g_btnBLastChangeMs) >= BTN_DEBOUNCE_MS && rawB != g_btnB) {
    bool old = g_btnB;
    g_btnB = rawB;
    if (g_btnB && !old) queueButtonB(now);
  }

  if (!rawA && g_btnA && (now - g_btnALastChangeMs) >= BTN_DEBOUNCE_MS) {
    g_btnA = false;
    g_btnAArmed = true;
  }
  if (!rawB && g_btnB && (now - g_btnBLastChangeMs) >= BTN_DEBOUNCE_MS) {
    g_btnB = false;
    g_btnBArmed = true;
  }

  if (!rawA && !g_btnA) g_btnAArmed = true;
  if (!rawB && !g_btnB) g_btnBArmed = true;
}

static void handleButtonActions() {
  if (!g_btnAPendingAction && !g_btnBPendingAction) return;

  uint32_t now = millis();
  if (now - g_lastBtnActionMs < BTN_ACTION_LOCKOUT_MS) return;

  if (g_btnAPendingAction) {
    g_btnAPendingAction = false;

    // KEY1 / USR1: cycle backlight brightness.
    cycleBacklightBrightness();
    g_lastBtnActionMs = now;

    Serial.print("[BTN] KEY1 brightness=");
    Serial.print(currentBacklightPercent());
    Serial.println("%");
    return;
  }

  if (g_btnBPendingAction) {
    g_btnBPendingAction = false;

    // KEY2 / USR2: screen backlight ON/OFF.
    toggleBacklight();
    g_lastBtnActionMs = now;

    Serial.print("[BTN] KEY2 backlight=");
    Serial.print(g_blOn ? "ON " : "OFF ");
    Serial.println(backlightStatusText());
    return;
  }
}

// ========================= D16 voltage sense measurement =========================

static uint16_t readBatteryMilliVolts() {
  return (uint16_t)analogReadMilliVolts(BAT_ADC_PIN);
}

static BatteryState readBatteryMeasured() {
  BatteryState r;

  uint32_t rawSum = 0;
  uint32_t mvSum = 0;
  uint16_t rawMin = 65535;
  uint16_t rawMax = 0;
  uint16_t mvMin = 65535;
  uint16_t mvMax = 0;

  for (uint8_t i = 0; i < BAT_SAMPLE_COUNT; i++) {
    uint16_t raw = (uint16_t)analogRead(BAT_ADC_PIN);
    uint16_t mv = readBatteryMilliVolts();

    rawSum += raw;
    mvSum += mv;

    if (raw < rawMin) rawMin = raw;
    if (raw > rawMax) rawMax = raw;
    if (mv < mvMin) mvMin = mv;
    if (mv > mvMax) mvMax = mv;

    delayMicroseconds(BAT_SAMPLE_DELAY_US);
  }

  r.raw = rawSum / BAT_SAMPLE_COUNT;
  r.rawMin = rawMin;
  r.rawMax = rawMax;

  r.mv = mvSum / BAT_SAMPLE_COUNT;
  r.mvMin = mvMin;
  r.mvMax = mvMax;
  r.spreadMv = mvMax - mvMin;

  r.vadc = r.mv / 1000.0f;
  r.rawVbat = r.vadc * BAT_DIVIDER_RATIO * BAT_CAL_FACTOR;
  r.vbat = r.rawVbat;
  r.percent = lipoPercent(r.vbat);
  r.valid = false;
  r.state = "MEASURED";

  return r;
}

static int updatePresencePercent(int measuredPercent, bool freshBattery) {
  measuredPercent = constrain(measuredPercent, 0, 100);
  uint32_t now = millis();

  if (freshBattery || g_batDisplayPercent < 0) {
    g_batDisplayPercent = measuredPercent;
    g_batLastPctRiseMs = now;
    return g_batDisplayPercent;
  }

  if (measuredPercent < g_batDisplayPercent) {
    g_batDisplayPercent = measuredPercent;
    return g_batDisplayPercent;
  }

  if (measuredPercent > g_batDisplayPercent &&
      (now - g_batLastPctRiseMs >= BAT_PCT_RISE_INTERVAL_MS)) {
    g_batDisplayPercent++;
    g_batLastPctRiseMs = now;
  }

  return g_batDisplayPercent;
}

static bool isImpossibleHighJump(const BatteryState &m) {
  if (!g_haveLastGoodBat) return false;

  float dv = m.rawVbat - g_lastGoodBat.rawVbat;
  int dp = m.percent - g_lastGoodBat.percent;

  return (dv >= BAT_IMPOSSIBLE_JUMP_V) || (dp >= BAT_IMPOSSIBLE_JUMP_PCT);
}

static bool isColdBootUsbSuspect(const BatteryState &m, bool stable) {
  if (!BAT_COLD_BOOT_HIGH_AS_USB) return false;
  if (g_haveLastGoodBat) return false;
  if (!stable) return false;
  return (m.percent >= BAT_COLD_BOOT_SUSPECT_PCT);
}

static void markBatteryAbsentLikeUsb(const BatteryState &measured, const char *stateName) {
  g_batUsbOnlySeen = true;
  g_batUsbInsertCompActive = false;
  g_batUsbInsertRawStartV = 0.0f;

  g_bat = measured;
  g_bat.valid = false;
  g_bat.percent = 0;
  g_bat.vbat = measured.rawVbat;
  g_bat.state = stateName;
  g_batFilterState = stateName;

  cache_sys = "";
}

static float batteryEffectiveVoltageForPercent(float rawV, bool freshBattery) {
  if (freshBattery && g_batUsbOnlySeen && !g_batUsbInsertCompActive) {
    g_batUsbInsertCompActive = true;
    g_batUsbInsertRawStartV = rawV;

    Serial.print("[BAT] USB-first battery insert compensation ON rawStart=");
    Serial.println(g_batUsbInsertRawStartV, 3);
  }

  if (g_batUsbInsertCompActive) {
    if (g_batUsbInsertRawStartV > 0.0f &&
        rawV <= (g_batUsbInsertRawStartV - BAT_USB_INSERT_RELEASE_DROP_V)) {
      g_batUsbInsertCompActive = false;

      Serial.print("[BAT] USB-insert compensation OFF raw=");
      Serial.println(rawV, 3);

      return rawV;
    }

    float compensated = rawV - BAT_USB_INSERT_SURFACE_COMP_V;
    if (compensated < BAT_EFFECTIVE_MIN_V) compensated = BAT_EFFECTIVE_MIN_V;
    return compensated;
  }

  return rawV;
}

static void updateBattery() {
  BatteryState measured = readBatteryMeasured();

  // UI reports D16 voltage sense data, not battery presence.
  // Keep raw measured values before BAT/USB filtering or percentage smoothing.
  g_vsense = measured;

  bool plausible = (measured.mv >= BAT_PRESENT_MIN_MV &&
                    measured.rawVbat >= BAT_VALID_MIN_V &&
                    measured.rawVbat <= BAT_VALID_MAX_V);

  bool stable = plausible && (measured.spreadMv <= BAT_FLOAT_RANGE_MV);

  if (isColdBootUsbSuspect(measured, stable)) {
    if (g_batColdUsbSuspectStreak < 255) g_batColdUsbSuspectStreak++;

    if (g_batColdUsbSuspectStreak >= BAT_VALID_CONFIRM_COUNT) {
      g_batValidStreak = 0;
      if (g_batInvalidStreak < 255) g_batInvalidStreak++;
      markBatteryAbsentLikeUsb(measured, "USB_BOOT_HIGH");
      return;
    }
  } else {
    if (g_batColdUsbSuspectStreak > 0) g_batColdUsbSuspectStreak--;
  }

