FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0715_DashBoard_096_ESP32/0715_DashBoard_096_ESP32.ino
  // Two-line voltage display. Clear the full SYS dynamic area to avoid residue
  // from the previous one-line BAT/USB/D16 layout.
  gfx->fillRect(SECTION_X0, Y_SYS_ROW1 - 2, 72, 21, C_BLACK);

  gfx->setTextSize(1);
  gfx->setTextColor(V_YELLOW, C_BLACK);
  gfx->setCursor(SECTION_X0 + 2, Y_SYS_ROW1);
  gfx->print(d16Line);

  gfx->setTextColor(V_YELLOW, C_BLACK);
  gfx->setCursor(SECTION_X0 + 2, Y_SYS_ROW2);
  gfx->print(calcLine);
}

static void drawStaticLayout() {
  if (!g_lcdOk) return;

  acquireForLcd();
  gfx->fillScreen(C_BLACK);
  cleanScreenEdges();
  drawHeader();

  drawSectionLabel(SECTION_X0 + 1, Y_SYS_LABEL, V_CYAN, "SYSTEM");
  drawSectionDivider(Y_SYS_DIV, V_WHITE);

  drawSectionLabel(SECTION_X0 + 1, Y_MOTION_LABEL, V_YELLOW, "MOTION");
  drawSectionDivider(Y_MOTION_DIV, V_WHITE);

  drawSectionLabel(SECTION_X0 + 1, Y_MIC_LABEL, V_GREEN, "MIC");
  drawVuFrame();

  gfx->drawFastHLine(5, 147, 70, V_WHITE);
  // Full product name rendered with a custom 3x5 footer font.
  // Width: 18 chars * 4 px - 1 = 71 px, fits the 80 px panel.
  acquireForLcd();
  gfx->fillRect(0, ROW_FOOT - 1, LCD_W, 8, C_BLACK);
  drawTiny3x5Text(4, ROW_FOOT + 1, "XIAO ESP32-S3 PLUS", V_YELLOW, C_BLACK);

  cache_header = "";
  cache_sys = "";
  cache_bl = "";
  g_d16ShownVadc = -1.0f;
  g_d16ShownCalc = -1.0f;
  cache_acc = "";
  cache_gyr = "";
  cache_tap = "";
  cache_raw = "";
  cache_ax_txt = "";
  cache_ay_txt = "";
  cache_az_txt = "";
  cache_gx_txt = "";
  cache_gy_txt = "";
  cache_gz_txt = "";
  g_imuTinyLabelsDrawn = false;
  g_cachedVuSegments = -1;
  g_cachedVuWidth = -1;
  g_cachedVuColor = 0xFFFF;
}

// ========================= IMU =========================

static bool initQmi(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x00, &who)) return false;
  if (who == 0x00 || who == 0xFF) return false;

  i2cWrite8(addr, 0x02, 0x60);
  i2cWrite8(addr, 0x03, 0x03);
  i2cWrite8(addr, 0x04, 0x53);
  i2cWrite8(addr, 0x08, 0x03);
  delay(20);

  uint8_t data[12] = {};
  if (!i2cRead(addr, 0x35, data, sizeof(data))) return false;

  g_imuType = IMU_QMI8658;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] QMI8658-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

static bool initLsm(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x0F, &who)) return false;
  if (who != 0x69 && who != 0x6A && who != 0x6C) return false;

  i2cWrite8(addr, 0x10, 0x60);
  i2cWrite8(addr, 0x11, 0x60);
  delay(20);

  g_imuType = IMU_LSM6DS3;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] LSM6-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

// LSM6 double-tap registers.
static constexpr uint8_t LSM_REG_TAP_SRC     = 0x1C;
static constexpr uint8_t LSM_REG_CTRL1_XL    = 0x10;
static constexpr uint8_t LSM_REG_TAP_CFG     = 0x58;
static constexpr uint8_t LSM_REG_TAP_THS_6D  = 0x59;
static constexpr uint8_t LSM_REG_INT_DUR2    = 0x5A;
static constexpr uint8_t LSM_REG_WAKE_UP_THS = 0x5B;
static constexpr uint8_t LSM_REG_MD1_CFG     = 0x5E;

void IRAM_ATTR imuIntIsr() {
  g_imuIntFlag = true;
}

static bool initImuDoubleTap() {
  g_imuTapConfigured = false;

  if (g_imuType != IMU_LSM6DS3 || g_imuAddr == 0) {
    Serial.println("[IMU] double-tap INT skipped: non-LSM IMU");
    return false;
  }

  pinMode(IMU_INT_PIN, INPUT_PULLDOWN);

  bool ok = true;
  ok &= i2cWrite8(g_imuAddr, LSM_REG_CTRL1_XL, 0x60);
  ok &= i2cWrite8(g_imuAddr, LSM_REG_TAP_CFG, 0x8E);
  ok &= i2cWrite8(g_imuAddr, LSM_REG_TAP_THS_6D, 0x0C);
  ok &= i2cWrite8(g_imuAddr, LSM_REG_INT_DUR2, 0x7F);
  ok &= i2cWrite8(g_imuAddr, LSM_REG_WAKE_UP_THS, 0x80);
  ok &= i2cWrite8(g_imuAddr, LSM_REG_MD1_CFG, 0x08);

  uint8_t dummy = 0;
  (void)i2cRead8(g_imuAddr, LSM_REG_TAP_SRC, &dummy);

  attachInterrupt(digitalPinToInterrupt(IMU_INT_PIN), imuIntIsr, RISING);

  g_imuTapConfigured = ok;
  Serial.print("[IMU] LSM6 double tap D9 ");
  Serial.println(ok ? "OK" : "FAILED");

  return ok;
}

static void initImu() {
  pinMode(IMU_INT_PIN, INPUT_PULLUP);

  g_imuType = IMU_NONE;
  g_imuAddr = 0;
  g_imuOk = false;
  g_imuTapConfigured = false;

  if (initLsm(0x6A)) {
    initImuDoubleTap();
    return;
  }
  if (initLsm(0x6B)) {
    initImuDoubleTap();
    return;
  }
  if (initQmi(0x6B)) {
    initImuDoubleTap();
    return;
  }
  if (initQmi(0x6A)) {
    initImuDoubleTap();
    return;
  }

  Serial.println("[IMU] not found");
}

static void updateImu() {
  if (g_imuType == IMU_QMI8658) {
    uint8_t d[12] = {};
    if (!i2cRead(g_imuAddr, 0x35, d, sizeof(d))) {
      g_imuOk = false;
      return;
    }

    g_ax = le16(&d[0]) / 16384.0f;
    g_ay = le16(&d[2]) / 16384.0f;
    g_az = le16(&d[4]) / 16384.0f;

    g_gx = le16(&d[6]) / 64.0f;
    g_gy = le16(&d[8]) / 64.0f;
    g_gz = le16(&d[10]) / 64.0f;

    g_imuOk = true;
  } else if (g_imuType == IMU_LSM6DS3) {
    uint8_t g[6] = {};
    uint8_t a[6] = {};

    if (!i2cRead(g_imuAddr, 0x22, g, sizeof(g)) ||
        !i2cRead(g_imuAddr, 0x28, a, sizeof(a))) {
      g_imuOk = false;
      return;
    }

    g_gx = le16(&g[0]) * 0.00875f;
    g_gy = le16(&g[2]) * 0.00875f;
    g_gz = le16(&g[4]) * 0.00875f;

    g_ax = le16(&a[0]) * 0.000061f;
    g_ay = le16(&a[2]) * 0.000061f;
    g_az = le16(&a[4]) * 0.000061f;

    g_imuOk = true;
  } else {
    g_imuOk = false;
  }
}

static void handleImuTapEvent() {
  if (!g_imuTapConfigured || g_imuType != IMU_LSM6DS3) return;

  bool shouldCheck = false;

  noInterrupts();
  if (g_imuIntFlag) {
    g_imuIntFlag = false;
    shouldCheck = true;
  }
  interrupts();

  if (digitalRead(IMU_INT_PIN) == HIGH) {
    shouldCheck = true;
  }

  if (!shouldCheck) return;

  uint8_t src = 0;
  if (!i2cRead8(g_imuAddr, LSM_REG_TAP_SRC, &src)) return;

  if (src & 0x10) {
    uint32_t now = millis();
    if (now - g_lastTapMs > TAP_DEBOUNCE_MS) {
      g_lastTapMs = now;
      g_doubleTapCount++;

      Serial.print("[TAP] double tap count=");
      Serial.print(g_doubleTapCount);
      Serial.print(" src=0x");
      Serial.println(src, HEX);
    }
  }
}

