FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0715_DashBoard_096_ESP32/0715_DashBoard_096_ESP32.ino
// ========================= MIC =========================

static void deinitMic() {
#if ESP_IDF_VERSION_MAJOR >= 5
  if (g_i2sRxChan) {
    i2s_channel_disable(g_i2sRxChan);
    i2s_del_channel(g_i2sRxChan);
    g_i2sRxChan = nullptr;
  }
#else
  i2s_driver_uninstall(I2S_PORT);
#endif
  g_micOk = false;
}

static bool initMic() {
  deinitMic();

#if ESP_IDF_VERSION_MAJOR >= 5
  i2s_chan_config_t chanCfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
  chanCfg.dma_desc_num = 4;
  chanCfg.dma_frame_num = MIC_SAMPLES_PER_READ;

  esp_err_t err = i2s_new_channel(&chanCfg, nullptr, &g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_new_channel failed: %d\n", (int)err);
    return false;
  }

  i2s_pdm_rx_config_t pdmCfg = {};
  pdmCfg.clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(MIC_SAMPLE_RATE_HZ);
  pdmCfg.slot_cfg = I2S_PDM_RX_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO);
  pdmCfg.gpio_cfg.clk = (gpio_num_t)MIC_CLK_PIN;
  pdmCfg.gpio_cfg.din = (gpio_num_t)MIC_DATA_PIN;
  pdmCfg.gpio_cfg.invert_flags.clk_inv = MIC_CLK_INVERT;

  err = i2s_channel_init_pdm_rx_mode(g_i2sRxChan, &pdmCfg);
  if (err != ESP_OK) {
    Serial.printf("[MIC] init_pdm failed: %d\n", (int)err);
    deinitMic();
    return false;
  }

#if REDUCE_PDM_CLK_DRIVE
  gpio_set_drive_capability((gpio_num_t)MIC_CLK_PIN, GPIO_DRIVE_CAP_0);
#endif

  err = i2s_channel_enable(g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] enable failed: %d\n", (int)err);
    deinitMic();
    return false;
  }
#else
  i2s_config_t cfg = {};
  cfg.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM);
  cfg.sample_rate = MIC_SAMPLE_RATE_HZ;
  cfg.bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT;
  cfg.channel_format = I2S_CHANNEL_FMT_ONLY_LEFT;
  cfg.communication_format = I2S_COMM_FORMAT_I2S;
  cfg.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  cfg.dma_buf_count = 4;
  cfg.dma_buf_len = MIC_SAMPLES_PER_READ;

  esp_err_t err = i2s_driver_install(I2S_PORT, &cfg, 0, nullptr);
  if (err != ESP_OK) return false;

  i2s_pin_config_t pins = {};
  pins.bck_io_num = I2S_PIN_NO_CHANGE;
  pins.ws_io_num = MIC_CLK_PIN;
  pins.data_out_num = I2S_PIN_NO_CHANGE;
  pins.data_in_num = MIC_DATA_PIN;

  if (i2s_set_pin(I2S_PORT, &pins) != ESP_OK) return false;
#endif

  g_micOk = true;
  Serial.println("[MIC] OK");
  return true;
}

static bool readMic(size_t *bytesRead, uint32_t timeoutMs) {
  *bytesRead = 0;

#if ESP_IDF_VERSION_MAJOR >= 5
  if (!g_i2sRxChan) return false;
  esp_err_t err = i2s_channel_read(g_i2sRxChan, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#else
  esp_err_t err = i2s_read(I2S_PORT, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#endif

  return (err == ESP_OK && *bytesRead > 0);
}

static void updateMic() {
  if (!g_micOk) return;

  size_t bytesRead = 0;
  if (!readMic(&bytesRead, 2)) return;

  uint32_t count = bytesRead / sizeof(int16_t);
  if (!count) return;

  int64_t sum = 0;
  for (uint32_t i = 0; i < count; i++) {
    sum += g_pdmBuf[i];
  }

  int32_t mean = (int32_t)(sum / count);
  uint32_t peak = 0;
  uint64_t sq = 0;

  for (uint32_t i = 0; i < count; i++) {
    int32_t v = (int32_t)g_pdmBuf[i] - mean;
    uint32_t a = v < 0 ? (uint32_t)(-v) : (uint32_t)v;
    if (a > peak) peak = a;
    sq += (uint64_t)a * a;
  }

  g_micPeak = peak;
  g_micRms = (uint32_t)sqrt((double)sq / count);
  g_micLastUpdateMs = millis();
}

static uint32_t currentMicPeak() {
  uint32_t now = millis();

  if (now - g_micLastUpdateMs > 120) {
    g_micPeak = (uint32_t)(g_micPeak * 0.80f);
    g_micRms = (uint32_t)(g_micRms * 0.80f);
  }

  return g_micPeak;
}

// ========================= VU =========================

static int vuLevelToSegments(float level) {
  if (level <= 0.0f) return 0;

  if (level < 0.12f) return 1;
  if (level < 0.22f) return 2;
  if (level < 0.34f) return 3;
  if (level < 0.48f) return 4;
  if (level < 0.64f) return 5;
  if (level < 0.80f) return 6;
  if (level < 0.93f) return 7;
  return 8;
}

static int debounceVuDesired(int desired, uint32_t now) {
  if (desired == g_vuDisplaySegments) {
    g_vuCandidateSegments = desired;
    g_vuCandidateCount = 0;
    return g_vuDisplaySegments;
  }

  if (desired > g_vuDisplaySegments) {
    if (now < g_vuFallGuardUntilMs && desired <= g_vuDisplaySegments + 1) {
      return g_vuDisplaySegments;
    }
  }

  if (desired < g_vuDisplaySegments) {
    g_vuFallGuardUntilMs = now + 150;
    return desired;
  }

  if (desired != g_vuCandidateSegments) {
    g_vuCandidateSegments = desired;
    g_vuCandidateCount = 1;
  } else if (g_vuCandidateCount < 255) {
    g_vuCandidateCount++;
  }

  if (g_vuCandidateCount >= 2 || desired >= g_vuDisplaySegments + 2) {
    return desired;
  }

  return g_vuDisplaySegments;
}

static uint16_t vuColorForSegment(int i) {
  if (i >= 6) return V_RED;
  if (i >= 4) return V_YELLOW;
  return V_GREEN;
}

static void drawVuBlocks(int segs) {
  if (!g_lcdOk) return;

  acquireForLcd();
  for (int i = 0; i < VU_SEG_COUNT; i++) {
    int x = VU_X + 1 + i * (VU_SEG_W + VU_GAP);
    uint16_t c = (i < segs) ? vuColorForSegment(i) : C_BLACK;
    gfx->fillRect(x, VU_Y + 2, VU_SEG_W, VU_H - 4, c);
  }

  g_cachedVuSegments = segs;
}

static void updateVu() {
  if (!g_lcdOk) return;

  uint16_t peak = currentMicPeak();

  // Same 0.96 compact VU behavior: RMS main source, peak helps attack.
  float metric = (float)g_micRms * 0.82f + (float)peak * 0.012f;
  if (metric < 0.0f) metric = 0.0f;
  if (metric > 240.0f) metric = 240.0f;

  uint32_t now = millis();

  if (!g_micNoiseReady) {
    if (g_micNoiseStartMs == 0) g_micNoiseStartMs = now;
    g_micNoiseFloor = g_micNoiseFloor * 0.84f + metric * 0.16f;
    if (now - g_micNoiseStartMs > 1200UL) g_micNoiseReady = true;
  } else {
    if (metric < g_micNoiseFloor) {
      g_micNoiseFloor = g_micNoiseFloor * 0.84f + metric * 0.16f;
    } else if (metric < g_micNoiseFloor + 5.0f) {
      g_micNoiseFloor = g_micNoiseFloor * 0.992f + metric * 0.008f;
    }
  }

  float signal = metric - g_micNoiseFloor - 26.0f;
  if (signal < 0.0f) signal = 0.0f;

