FaiyuetCik/Display-Gadgets/code/example/096_ESP32/0715_DashBoard_096_ESP32/0715_DashBoard_096_ESP32.ino
  printHeader();

  pinMode(BTN_A_PIN, INPUT_PULLUP);
  pinMode(BTN_B_PIN, INPUT_PULLUP);
  pinMode(IMU_INT_PIN, INPUT_PULLUP);

  g_btnARaw = digitalRead(BTN_A_PIN);
  g_btnBRaw = digitalRead(BTN_B_PIN);
  g_btnA = (g_btnARaw == LOW);
  g_btnB = (g_btnBRaw == LOW);
  g_btnALastRawPressed = g_btnA;
  g_btnBLastRawPressed = g_btnB;
  g_btnAArmed = !g_btnA;
  g_btnBArmed = !g_btnB;
  g_btnALastChangeMs = millis();
  g_btnBLastChangeMs = millis();

  attachInterrupt(digitalPinToInterrupt(BTN_A_PIN), btnAIrqIsr, FALLING);
  attachInterrupt(digitalPinToInterrupt(BTN_B_PIN), btnBIrqIsr, FALLING);

  analogReadResolution(12);
#if defined(ADC_11db)
  analogSetPinAttenuation(BAT_ADC_PIN, ADC_11db);
#endif

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);

  g_micNoiseStartMs = millis();
  g_micNoiseReady = false;
  g_micNoiseFloor = 65.0f;
  g_vuSmooth = 0.0f;
  g_vuFast = 0.0f;
  g_vuDisplaySegments = 0;
  g_vuCandidateSegments = 0;
  g_vuCandidateCount = 0;
  g_vuFallGuardUntilMs = 0;
  g_cachedVuSegments = -1;
  g_cachedVuWidth = -1;
  g_cachedVuColor = 0xFFFF;
  g_lastVuStepMs = millis();
  g_lastVuRenderMs = millis();

  initLcd();
  drawStaticLayout();

  initMic();
  initImu();

  updateBattery();
  cache_sys = "";
  drawBatteryRowTiny();

  updateImu();
  updateMic();
  updateUiFast();
  updateUiSlow();
  updateVu();
  printSerialStatus();

  Serial.println("[BOOT] 0.96 ESP32-S3 dashboard v1.13.1 D16-two-line-yellow ready");
}

void loop() {
  uint32_t now = millis();

  handleImuTapEvent();
  updateButtons();
  handleButtonActions();
  updateMic();

  if (now - g_lastBatMs >= BAT_REFRESH_MS) {
    g_lastBatMs = now;
    updateBattery();
  }

  if (now - g_lastVuMs >= UI_VU_MS) {
    g_lastVuMs = now;
    updateVu();
  }

  if (now - g_lastFastMs >= UI_FAST_MS) {
    g_lastFastMs = now;
    updateUiFast();
  }

  if (now - g_lastSlowMs >= UI_SLOW_MS) {
    g_lastSlowMs = now;
    updateImu();
    updateUiSlow();
  }

  if (now - g_lastSerialMs >= SERIAL_MS) {
    g_lastSerialMs = now;
    printSerialStatus();
  }

  delay(2);
}
